#+title: CYCLOTRONS’59
#+venue: Sea Island, Georgia, USA
#+eventdate: 1959-02-02/1959-02-04
#+eventtitle: Conference on Sector-Focused Cyclotrons
#+shorteventtitle: CYC’59
#+booktitle: Proceedings of an Informal Conference on Sector-Focused Cyclotrons
#+isobooktitle: Proc. Informal Conf. Sect.-Focus. Cyclotr.
#+shortbooktitle: Proc. CYC’59


[[file:all-jacow-events.org][All JACoW Events]]



#+begin_src bibtex 
  @proceedings{JACoW:CYC1959:Proc:,
  eventtitle={Conference on Sector-Focused Cyclotrons},
  eventtitle+an:short={="CYC’59"},
  eventdate={1959-02-02/1959-02-04},
  venue={Sea Island, Georgia, USA},
  booktitle={Proceedings of an Informal Conference on Sector-Focused Cyclotrons},
  booktitle+an:ISO= {="Proc. Informal Conf. Sect.-Focus. Cyclotr."},
  booktitle+an:short={="Proc. CYC’59"},
  options={dataonly},
  }
#+end_src
so that we can use
#+begin_src bibtex :tangle no :noweb-ref Proc. CYC1959
  crossref={JACoW:CYC1959:Proc:},
#+end_src
instead of putting the following fields into every single entry:
#+begin_src bibtex :tangle no :noweb-ref Proc. CYC1959'
  eventtitle={Conference on Sector-Focused Cyclotrons},
  eventtitle+an:short={="CYC’59"},
  eventdate={1959-02-02/1959-02-04},
  venue={Sea Island, Georgia, USA},
  booktitle={Proceedings of an Informal Conference on Sector-Focused Cyclotrons},
  booktitle+an:ISO= {="Proc. Informal Conf. Sect.-Focus. Cyclotr."},
  booktitle+an:short={="Proc. CYC’59"},
#+end_src

We can also use =@xdata= type for the proceedings and set =xdata= (instead of =crossref=).

* Export


#+begin_src emacs-lisp :eval t
  (let ((org-time-stamp-custom-formats
         '("<%Y-%m-%d>" . "%Y-%m-%d %a %H:%M"))
        (org-display-custom-times 't))
    (org-table-map-tables
     (lambda ()
       (org-table-export
        (concat "./csv/" (file-name-base) (org-entry-get (point) "TAGS") ".tsv")
        "orgtbl-to-tsv"))))
#+end_src

#+RESULTS:
: Mapping tables: done


